function Respond(msg){
	if(msg ==='裸夫!幫忙討論餐廳!!'){
		return ['大喊【裸夫!餐廳:<餐廳名稱>】，讓裸夫知道你們的提案。',
				'大喊【裸夫!餐廳清單!!】，裸夫知道會將提案清單列出。',
				'大喊【裸夫!清除清單!!】，裸夫會將提案清單給消滅。',
				'大喊【裸夫!移除編號:<清單編號>】，裸夫會此編號的選項移除。',
				'大喊【裸夫!幫忙決定餐廳!!】，裸夫會幫忙決定一家餐廳。',
		]
	}
	
	if(msg === '++'){
		return '上線阿';
	}
	
	if(msg === '屁卡!!'){
		return '胖';
	}
	if(msg === '裸夫'){
		return '我是裸夫!!也可以叫我仁捷';
	}
	if(msg === '打?'){
		return '不要!我要玩R6!!';
	}
	if(msg.match('安安')){
		return ['摳尼基挖','你今天穿衣服了嗎?'];
	}
	if(msg.match('仁捷')!=null && msg.indexOf('仁捷')!=3){
	//句子包含'仁捷'但是仁捷不在 3 這個位子
		return '你知道仁捷就是是裸夫嗎?穿衣服會覺得的羞恥:relaxed:';
	}
	
	return ""; //null時，nodejs會判斷為空系統會發出警告
}
module.exports = Respond;